Orale/orale.tex
% Created 2026-01-04 Sun 18:10
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Leonardo Ascenzi}
\date{\today}
\title{Orale ing del software}
\hypersetup{
 pdfauthor={Leonardo Ascenzi},
 pdftitle={Orale ing del software},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Significato include/exclude negli use case}
\label{sec:orgeac9109}
Il diagramma degli use case permettere di rappresentare graficamente le interazioni tra attori e sistema, specificando quali casi d'uso gli attori possono attivare.
\subsection{Include:}
\label{sec:org7ef4783}
Indica che un caso d'uso include \textbf{\textbf{obbligatoriamente}} un altro caso d'uso per completare la sua funzionalitá.
Utilizzato quando il comportamento di un caso d'uso é riutilizzabile per altri casi d'uso.
Caso d'uso principale richiede l'esecuzione dei casi d'uso inclusi.
\subsection{Extend:}
\label{sec:org47461b2}
Indica che un caso d'uso puó estendere \textbf{\textbf{opzionalmente}} un altro caso d'uso, aggiungendo funzionalitá alternative o opzionali.
Utilizzato per rappresentare casi che si verificano solo in determinate condizioni.
L'attivazione del caso d'uso esteso dipende da una determinata condizione.
\section{Requisiti Software}
\label{sec:orgf4a0e3b}
I requisiti del software sono la \textbf{\textbf{descrizione dei servizi}} che un sistema software deve fornire, insieme ai vincoli da rispettare sia in fase di sviluppo che durante la fase di operativitá.
\subsection{Requisiti utente:}
\label{sec:org1e42ba3}
Descrizione in \textbf{\textbf{linguaggio naturale}} dei \textbf{\textbf{servizi}} che il sistema deve fornire e dei \textbf{\textbf{vincoli operativi}}.
\subsection{Requisiti di sistema:}
\label{sec:orgf3091ed}
Specificati mediante la \textbf{\textbf{stesura di un documento strutturato}} che descrive in modo dettagliato i \textbf{\textbf{servizi che il sistema software deve fornire}}.
Si dividono in \textbf{\textbf{3}} categorie:
\subsubsection{Funzionali:}
\label{sec:org31eaa5a}
Definiscono le funzionalitá del sistema, ovvero i servizi offerti, le reazioni a specifici input e il comportamento in diverse situazioni operative.
\subsubsection{Non funzionali:}
\label{sec:orgd7b9faf}
Descrivono le qualitá del sistema e del processo di sviluppo, come efficienza, affidabilitá, sicurezza ed altre caratteristiche esterne.
\subsubsection{Dominio:}
\label{sec:org901fbb1}
Derivano dal contesto applicativo del sistema.
\subsection{Differenze:}
\label{sec:org8328227}
I requisiti funzionali in breve \textbf{\textbf{definiscono}} tutte le \textbf{\textbf{operazioni}} che il \textbf{\textbf{sistema deve eseguire}}.
Gli altri \textbf{\textbf{definiscono}} tutte le \textbf{\textbf{funzionalitá}} che il \textbf{\textbf{sistema deve rispettare}}.
\section{Modello ciclo di vita}
\label{sec:orgaf621fd}
Definisce le fasi attraverso cui il prodotto software evolve, dalla raccolta dei requisiti alla dismissione e l'ordine in cui tali fasi vengono eseguite.
La scelta del modello dipende da fattori come la natura e la maturitá dell'organizzazione, le tecnologie adottate e i vincoli del cliente.
\subsection{Principali modelli}
\label{sec:orgdd5bf33}
\subsubsection{Build \& Fix}
\label{sec:org6d5094e}
Modello privo di struttura formale; il prodotto viene sviluppato e poi modificato fino a soddisfare le esigenze del cliente.
\subsubsection{Waterfall}
\label{sec:org99466c2}
Modello sequenziale a fasi successive copn verifica alla fine di ogni fase; adatto a progetti con requisiti ben definiti.
\subsubsection{Spirale}
\label{sec:org2a8b042}
Modello iterativo che combina l'approccio del Waterfall con una forte enfasi sull'analisi dei rischi; ideale per progetti complessi e soggetti a cambiamenti nei requisiti.
\section{Risk Analysis}
\label{sec:org199a754}
È il processo di identificazione, valutazione e gestione dei potenziali problemi che possono compromettere il successo di un progetto software.
\subsection{Fasi principali:}
\label{sec:orga16abd6}
\begin{enumerate}
\item Identificazione dei rischi:
Individuare tutte le minacce che possono influire negativamente sul progetto.

\item Valutazione dei rischi:
Stimare l'impatto e la probabilitá di ogni rischio.

\item Prioritizzazione:
Stabilire quali rischi gestire per primi.

\item Pianificazione delle mitigazioni:
Definire le azioni per ridurre la probabilitá o l'impatto dei rischi.

\item Monitoraggio continuo:
Assicurarsi che i rischi siano monitorati durante tutto il ciclo di vita del software.
\end{enumerate}
\section{Architettura software - Architettura oggetti distribuiti}
\label{sec:org3394656}
L'architettura di sistema definisce la struttura dei componenti del sistema software, insieme alle relazioni tra questi ultimi.
L'architettura ad oggetti distribuiti é un'architettura di sistema che non fa distinzioni tra client/server, infatti ogni oggetto distribuito puó fungere sia da client che da server.
La comunicazione remota fra gli oggetti é resa trasparente usando middleware basati sul concetto di software bus.
Le applicazioni basate su questa architettura consistono in un insieme di oggetti che sono eseguiti su piattaforme distribuite ed eterogenee, e comunicano tramite invocazioni remote dei metodi.
\section{ORB - Object Request Broker}
\label{sec:org298351c}
É un componente middleware che abilita la comunicazione trasparente tra oggetti distribuiti su rete, indipendentemente da posizione fisica, linguaggio di programmazione o sistema operativo
É il cuore delle architetture ad oggetti distribuiti, come CORBA.
\subsection{Funzionamento}
\label{sec:orgd920114}
\textbf{\textbf{Intermediazione Richieste:}} il client invoca un metodo su un oggetto remoto; ORB localizza il server, inoltra la richiesta e restituisce il risultato.
\textbf{\textbf{Gestione Dati:}} si occupa di serializzazione e deserializzaziopne dei parametri, oltre ai protocolli di rete
\textbf{\textbf{Trasparenze Fornite:}} location trasparency e implementation trasparency.
\subsection{Vantaggi}
\label{sec:org1b9de83}
Permette agli sviluppatori di concentrarsi sulla logica applicativa, astraendo la complessitá della distribuzione.
\section{Relazione tra prodotto e costo di produzione}
\label{sec:orga8460c8}
La relazione tra prodotto software e costo di produzione é prevalentemente positiva: maggiore é la dimensione, la complessitá o la qualitá del prodotto, maggiore é il costo iniziale di sviluppo, ma con impatti variabili sui costi a lungo termine.
\subsection{Fattori principali}
\label{sec:org7a1bcde}
\textbf{\textbf{Dimensione del prodotto:}} La complessitá e le funzionalitá aumentano direttamente lo sforzo e i costi, spesso in modo non lineare.
\textbf{\textbf{Qualitá:}} Investire in qualitá eleva i costi iniziali, ma riduce quelli futuri di manutenzione e correzioni.
\textbf{\textbf{Processi di sviluppo:}} Metodologie efficienti e automazione abbassano i costi mantenendo la qualitá
\subsection{Equilibrio costi}
\label{sec:org6a955ff}
\textbf{\textbf{Scalabilitá e modularitá:}} Favoriscono costi minori in fase di aggiornamenti e manutenzioni, bilanciando l'investimento iniziale.
\textbf{\textbf{Sintesi:}} Esiste un trade-off tra costi di produzione upfront e spese post-rilascio, ottimizzabile con stime accurate basate su dimensioni funzionali.
