Orale/orale.tex
\section{Service Oriented Architecture}
\label{sec:org0dc80d8}
La SOA é un'architettura software distribuita che consiste in molteplici servizi.
I Servizi sono distribuiti in maniera tale da poter essere eseguiti su nodi differenti con differenti service provider.
L'obiettivo é quello di sviluppare applicazioni software composte da servizi distribuiti, in modo tale che i singoli servizi possano essere eseguiti su piú piattaforme differenti e implementati con differenti linguaggi di programmazione
All'interno delle SOA troviamo ORB che permette la comunicazione tra i client e i servizi distribuiti.

Il fulcro dell'implementazione SOA sono i web services, e sfruttano vari protocolli per far comunicare i servizi fra di loro.

Tra questi troviamo:
\textbf{\textbf{SOAP:}} protocollo basato su XML e HTML che permette lo scambio di informazioni in un sistema distribuito. Utilizza protocolli di trasporto come HTTP, SMTP.
\textbf{\textbf{REST:}} architettura che utilizza i metodi HTML per operazioni CRUD.

Oltre che ai web services, le SOA utilizzano altri servizi, tra cui:
\textbf{\textbf{UDDI:}} aiuta a localizzare e identificare i servizi presenti in una rete.
\textbf{\textbf{WSDL:}} Linguaggio basato su XML utilizzato per descrivere le interfacce dei servizi in un'architettura di SOA.
\section{Secondo quali attivitá va declinata la fase di testing?}
\label{sec:orgf3d3565}
La fase di testing é articolata in una serie di attivitá che assicurano la soddisfazione dei requisiti definiti.
Queste attivitá sono:

\begin{enumerate}
\item \textbf{\textbf{Pianificazione del testing:}}
\begin{itemize}
\item Definizione degli obiettivi del testing.
\item Identificazione delle risorse necessarie.
\item Pianificazione temporale e stima dei costi.
\end{itemize}
\item \textbf{\textbf{Progettazione dei Test Case:}}
\begin{itemize}
\item Creazione di scenari di test basati sui requisiti funzionali e non funzionali.
\item Identificazione delle versioni software da testare.
\end{itemize}
\item \textbf{\textbf{Preparazione dell'ambiente di test:}}
\begin{itemize}
\item Configurazione degli ambienti (Hardware, Software, Reti).
\item Installazione delle versioni del software da testare.
\end{itemize}
\item \textbf{\textbf{Esecuzione dei test:}}
\begin{itemize}
\item Esecuzione dei casi di test progettati.
\item Registrazione dei risultati (Successo o Fallimento) e documentazione delle anomalie.
\end{itemize}
\item \textbf{\textbf{Analisi dei risultati:}}
\begin{itemize}
\item Confronto tra risultati ottenuti e quelli attesi.
\item Identificazione e classificazione dei difetti.
\end{itemize}
\item \textbf{\textbf{Risoluzione dei problemi:}}
\begin{itemize}
\item Collaborazione con il team di sviluppo per risolvere i difetti identificati.
\item Verifica delle correzioni.
\end{itemize}
\item \textbf{\textbf{Test di regressione:}}
\begin{itemize}
\item Assicurarsi che le modifiche al codice non abbiano introdotto nuovi errori.
\end{itemize}
\item \textbf{\textbf{Valutazione finale e report:}}
\begin{itemize}
\item Verifica se il prodotto soddisfa i criteri di accettazione.
\item Redazione di un report con le conclusioni del testing.
\end{itemize}
\end{enumerate}
\section{Come si chiama il testing di validazione per i software a contratto?}
\label{sec:orgd443b8b}
Il testing di validazione per i software a contratto é chiamato \textbf{\textbf{Acceptance Testing.}}
\begin{itemize}
\item \textbf{\textbf{Definizione:}}
É l'utlima fase del ciclo di testing, in cui il cliente o l'utente finale verifica che il software soddisfi i requisiti contrattuali e sia pronto per il rilascio.
\item \textbf{\textbf{Scopo:}}
Validare che il software sia conforme alle specifiche contrattuali e garantire la piena utilizabilitá nel contesto operativo del cliente.
\end{itemize}
\section{Ciclo di vita del Software}
\label{sec:org055dc01}
\subsection{Definizione Formale}
\label{sec:orge9fbf84}
Il ciclo di vita di un software é il quadro strutturale che organizza in fasi, attivitá e compiti tutti i processi di sviluppo, esericizo e manutenzione di un prodotto software, dalla definizione dei requisiti fino alla dismissione del sistema.
É suddiviso in 3 stadi, il primo stadio a sua volta é composto da 6 fasi.
\subsection{Stadi}
\label{sec:org39a4437}
\subsubsection{Stadio 1: Sviluppo}
\label{sec:orgd3347c1}
\begin{itemize}
\item Requisiti
\item Specifiche
\item Pianificazione
\item Progetto
\item Codifica
\item Integrazione
\end{itemize}
\subsubsection{Stadio 2: Manutenzione}
\label{sec:org6569d7c}
Copre circa il 60\% dei costi del ciclo di vita
\subsubsection{Stadio 3: Dismissione}
\label{sec:orge246272}
\subsection{Fasi dello Stadio di Sviluppo}
\label{sec:org0c3137e}
\subsubsection{1. Requisiti}
\label{sec:org24e1cfe}
\textbf{\textbf{Obiettivo:}} Identificare e raccogliere le esigenze degli stakeholder.
\textbf{\textbf{Descrizione:}} In questa fase si effettua la raccolta, l'analisi e la documentazione dettagliata delle esigenze degli utenti e degli stakeholder, per definire cosa il sistema deve fare e i suoi vincoli operativi.
\textbf{\textbf{Attivitá Principali:}}
\begin{itemize}
\item Interviste con utenti e clienti.
\item Analisi delle esigenze funzionali.
\item Identificazione dei requisiti non funzionali.
\item Creazione di una lista iniziale di requisiti.
\end{itemize}
\subsubsection{2. Specifiche}
\label{sec:org34ba537}
\textbf{\textbf{Obiettivo:}} Documentare e dettagliare i requisiti raccolti nella fase precedente.
\textbf{\textbf{Descrizione:}} Approfondisce i requisiti in specifiche tecniche dettagliate, producendo documenti come \textbf{\textbf{SRS (Software Require Specification)}} o \textbf{\textbf{SFS (Software Functional Specification)}} che serviranno nelle fasi successive.
\textbf{\textbf{Attivitá Principali:}}
\begin{itemize}
\item Analisi di fattibilitá tecnica ed economica.
\item Stesura dei documenti di specifiche.
\item Validazione dei requisiti con il cliente per verificare che siano corretti.
\end{itemize}
\subsubsection{3. Pianificazione}
\label{sec:org174b326}
\textbf{\textbf{Obiettivo:}} Organizzare il lavoro per il completamento del progetto.
\textbf{\textbf{Descrizione:}} Si definisce il piano del progetto: stime di costi/risorse/tempi, allocazione team, scelta strumenti/metodologie, identificazione rischi e definizione milestone. Produce il \textbf{\textbf{Project Plan}} con \textbf{Gant}, budget e criteri di monitoraggio. É cruciale per allineare stakeholder e gesstire scope.
\subsubsection{4. Progetto}
\label{sec:orgdf5fb29}
\textbf{\textbf{Obiettivo:}} Progettare l'architettura e i dettagli tecnici del software.
\textbf{\textbf{Descrizione:}} Si definisce la struttura del sistema e le componenti, fornendo un modello chiaro da seguire nella fase di sviluppo.
\textbf{\textbf{Attivitá Principali:}}
\begin{itemize}
\item Progettazione dell'architettura.
\item Creazione dei diagrammi UML, diagrammi di flusso e design delle interfacce.
\item Progettazione di database e definizione delle entitá.
\item Redazione del piano di test iniziale per assicurarsi cjhe il progetto sia verificabile.
\end{itemize}
\subsubsection{5. Codifica}
\label{sec:org5b392dc}
\textbf{\textbf{Obiettivo:}} Tradurre il design in un software funzionante.
\textbf{\textbf{Descrizione:}} In questa fase gli sviluppatori scrivono il codice sorgente seguendo le specifiche di progetto, standard di coding e best practice. Include unit testing durante lo sviluppo e commit in repository git. L'importanza di questa fase é per l'appunto la trasformazione da design a eseguibile, con enfasi su qualitá e leggibilitá.
\subsubsection{6. Integrazione}
\label{sec:org56d22af}
\textbf{\textbf{Obiettivo:}} Collegare i diversi moduli e testare il sistema completo.
\textbf{\textbf{Descrizione:}} SI assemblano i moduli/test unitari in un sistema coerente, verificando integrazioni tramite test di integrazione. Identifica e risolve difetti di interfaccia. Culmina in unn  prototipo parziale o completo pronto per essere testato.
\section{Qual é la manutenzione piú frequentemente utilizzata?}
\label{sec:org6ef0101}
La manutenzione piú frequentemente utilizzata é quella \textbf{\textbf{correttiva}}.
La manutenzione correttiva é l'insieme delle attivitá volte a correggere difetti, errori o malfunzionamenti riscontrati nel software dopo il suo rilascio in produzione, ripristinando la funzionalitá conforme alle specifiche originali.
\subsection{Altri tipi di manutenzioni}
\label{sec:org20947b6}
\begin{enumerate}
\item Adattiva
\label{sec:org9e920e1}
Modifiche al software per adattarlo ai cambiamenti dell'ambiente operativo.
\item Perfettiva
\label{sec:org61917fb}
Migliora le prestazioni o aggiunge nuove funzionalitá per soddisfare le richieste degli utenti.
\item Preventiva
\label{sec:orgfeef80c}
