Orale/orale.tex
Effettuare modifiche per ridurre richi di guasto o per prevenire dei problemi futuri.
\end{enumerate}
\section{Regola 10-90}
\label{sec:org69e40df}
La regola 10-90 é una variante della regola 90-90, un aforismo umoristico dell'ingegneria del software.
Questa regola afferma che: "Solo il 10\% del codice critico consuma il 90\% delle risorse di esecuzione o sviluppo".
Il 10\% del codice in questione si definisce \textbf{\textbf{core}} del programma.
\section{Stima durata progetto}
\label{sec:org1e5514d}
Per stimare la durata totale di un progetto software partendo dal documento di specifica, é necessario utilizzare tecniche di pianificazione e stima che si basano su dioversi fattori come la dimensione stimata del prodotto, le risorse disponibili e i processi di sviluppo.
La prima fase della stima é quella stimare le dimensioni totali del software. usando tecniche note che vedremo avanti.
Successivamente si stima la durata:
\begin{enumerate}
\item Modello algoritmico \textbf{\textbf{COCOMO:}}
\begin{itemize}
\item Stimando effort e poi tempo
\end{itemize}
\item Usando metodi empirici:
\begin{itemize}
\item Suddividere il progetto in attivitá specifiche e stimare la durata di goni attivitá e successivamente sommare tutte queste stime per averne una complessiva.
\end{itemize}
\end{enumerate}
\section{Organizzazione modello di qualitá del Software}
\label{sec:org400cb35}
Il modello di qualitá del software si strutturs principalmente attorno allo standard \textbf{\textbf{IEEE 1061}}, che fonrnisce un framework sistematico per definire, misurare e valutare la qualitá attraverso metriche quantitative legate a obiettivi specifici del progetto.
\subsection{Principi e struttura secondo IEEE 1061}
\label{sec:orgc2c56a5}
Lo standard organizza la qualitá del software identificando prima gli obiettivi di qualitá rilevanti per il contesto.
Successivamente, associa a questi obiettivi attributi di qualitá misurabili e metriche per valutarli.
Un elemento centrale sono gli indici di qualitá, che aggregano piú metriche in indicatori sintetici per monitorare le prestazioni complessive.
Questi indici si divono in tre gruppi principali, allineati al modello McCall.
\subsubsection{1. Attivitá di Revisione}
\label{sec:org2a368a8}
\begin{itemize}
\item \textbf{\textbf{Manutenibilitá:}} effort richiesto per individuare e correggere un errore in un programma operativo.
\item \textbf{\textbf{Flessibilitá:}} effort per modificare un prodotto software giá in uso.
\item \textbf{\textbf{Testabilitá:}} effort per testare il software e verificarne la correttezza funzionale.
\end{itemize}
\subsubsection{2. Attivitá di Transizione}
\label{sec:orgaaf06ea}
\begin{itemize}
\item \textbf{\textbf{Portabilitá:}} effort per traferire il software ad un nuovo ambiente hardware/software.
\item \textbf{\textbf{Riusabilitá:}} grado in cui parti del software possono essere riutilizzate in altre applicazioni.
\item \textbf{\textbf{Interoperabilitá:}} effort per integrare il software con altri sistemi.
\item \textbf{\textbf{Evolutivitá:}} effort per aggiornarlo con nuovi requisiti.
\end{itemize}
\subsubsection{3. Attivitá di Operazioni}
\label{sec:org2fde99d}
\begin{itemize}
\item \textbf{\textbf{Correttezza:}} misura in cui il software soddisfa specifiche e obiettivi utente.
\item \textbf{\textbf{Affidabilitá:}} probabilmente che svolga le funzioni previste con la precisione richiesta.
\item \textbf{\textbf{Efficienza:}} risorse di calcolo e codice necessarie per eseguire una funzione.
\item \textbf{\textbf{Integritá:}} protezione da accessi non autorizzati a software o dati.
\item \textbf{\textbf{Usabilitá:}} effort per imparere, usare, preparare input e interpretare output.
\end{itemize}
\subsubsection{Attributi di qualitá}
\label{sec:org37ad4cb}
Oltre aghli indici, \textbf{\textbf{IEEE 1061}} elenca attributi fondamentali, come:
\begin{itemize}
\item \textbf{\textbf{Complessitá:}} comprensibilitá e verificabilitá degli elementi e delle loro interazioni.
\item \textbf{\textbf{Precisione:}} accuratezza dei calcoli e e risultati.
\item \textbf{\textbf{Completezza:}} implementazione esaustiva delle funzionalità richieste.
\item \textbf{\textbf{Coerenza:}} uniformità di design, implementazione e notazioni.
\item \textbf{\textbf{Tolleranza:}} capacità di operare in condizioni avverse.
\item \textbf{\textbf{Tracciabilitá:}} legami chiari tra elementi del processo di sviluppo.
\item \textbf{\textbf{Espandibilitá:}} possibilità di ampliare memorie o funzioni.
\item \textbf{\textbf{Generalitá:}} ampiezza delle applicazioni potenziali.
\item \textbf{\textbf{Modularitá:}} indipendenza dei moduli.
\item \textbf{\textbf{Autodocumentazione:}} presenza di documentazione inline.
\end{itemize}

Questi attribuit sono mappati su metriche concrete
\subsubsection{Processo iterativo di valutazione}
\label{sec:orga7e4b28}
IEEE 1061 definisce un ciclo chiaro:
\begin{enumerate}
\item \textbf{\textbf{Definizione degli obiettivi:}} contestualizzati al progetto.
\item \textbf{\textbf{Identificazione degli attributi:}} selezione di quelli prioritari.
\item \textbf{\textbf{Scelta metriche:}} quantitative e rilevanti per ciascun attributo.
\item \textbf{\textbf{Misurazione:}} calcolo e confronto con benchmark o target.
\item \textbf{\textbf{Analisi e Feedback:}} miglioramento continuo basato sui risultati.
\end{enumerate}

Questa struttura garantisce che la qualitá sia oggettiva, misurabile e allineata agli stakeholder, riducendo soggettivitá e rischi.
\end{document}
